#Import The Customer Data

In [3]:
import os
import numpy as np
import pandas as pd

In [4]:
%pwd

u'C:\\Users\\Administrator'

In [5]:
%cd C://Users//Administrator//Desktop

C:\Users\Administrator\Desktop

In [6]:
%pwd

u'C:\\Users\\Administrator\\Desktop'

In [7]:
cus_data = pd.read_csv('Customers.csv')

In [8]:
cus_data.head(2)

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0

#Understand The Data Using Diffrent Functions

In [9]:
cus_data.shape

(10000, 14)

In [10]:
cus_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Customer_ID        10000 non-null int64
Gender             9986 non-null object
First_Date         10000 non-null int64
First_region       9979 non-null object
First_state        9983 non-null object
First_city         10000 non-null object
Recent_Date        10000 non-null int64
Last_region        10000 non-null object
Last_state         10000 non-null object
Last_city          10000 non-null object
Customer_Value     9964 non-null float64
Buy_Times          10000 non-null int64
Points_Earned      9979 non-null float64
Points_Redeemed    9988 non-null float64
dtypes: float64(3), int64(4), object(7)
memory usage: 1.1+ MB

In [11]:
cus_data.columns

Index([u'Customer_ID', u'Gender', u'First_Date', u'First_region',
       u'First_state', u'First_city', u'Recent_Date', u'Last_region',
       u'Last_state', u'Last_city', u'Customer_Value', u'Buy_Times',
       u'Points_Earned', u'Points_Redeemed'],
      dtype='object')

In [12]:
cus_data.get_dtype_counts

<bound method DataFrame.get_dtype_counts of       Customer_ID Gender  First_Date First_region     First_state  \
0       129609144      M    20130130         West         Gujarat
1       129627580      M    20130129        North           Delhi
2       130363481      M    20130221         West         Gujarat
3        49817480      M    20130222         West     Maharashtra
4       126343829      F    20130301        North           Delhi
5         8223758      F    20130314         West         Gujarat
6       131816709      M    20130318        South  Andhra Pradesh
7       118543320      F    20130321        North   Uttar Pradesh
8       131365512      M    20130323         East     West Bengal
9          758571      M    20130324        South       Karnataka
10       85489184      M    20120101         West     Maharashtra
11       85438231      M    20120103         West     Maharashtra
12       74053888      F    20120102         West         Gujarat
13        7256956      M    20120102        North       Rajasthan
14        1610085      F    20120103        North           Delhi
15        7518872      M    20120104        North   Uttar Pradesh
16        8638553      M    20120103         West         Gujarat
17       85438392      M    20120103         West         Gujarat
18       63508964      M    20120106         West     Maharashtra
19       23667984      F    20120107         West     Maharashtra
20       84634600      M    20120108        South       Karnataka
21       85207999      M    20120110        South  Andhra Pradesh
22       86066230      M    20120111         West         Gujarat
23        6888521      M    20120112         West     Maharashtra
24       87030390      M    20120111         East     West Bengal
25       85645488      M    20120111        North  Madhya Pradesh
26       12935950      M    20120113         West         Gujarat
27       10954886      F    20120115        North  Madhya Pradesh
28       84437746      M    20120115         East     West Bengal
29        7514232      M    20120114        North           Delhi
...           ...    ...         ...          ...             ...
9970      5599557      F    20120115         West         Gujarat
9971      7956527      F    20120115        North           Delhi
9972     10184222      M    20120116        North   Uttar Pradesh
9973     88092811      M    20120116         West         Gujarat
9974     84750517      F    20120119         West         Gujarat
9975      5686217      M    20120118         West     Maharashtra
9976     63669926      M    20120118        South       Telangana
9977     90964885      M    20120121         West         Gujarat
9978     87989417      M    20120127         West         Gujarat
9979      6005239      M    20120129         East     West Bengal
9980     91066310      M    20120130         West         Gujarat
9981       414338      M    20120131         West         Gujarat
9982      9144258      M    20120130        South      Tamil Nadu
9983     91076263      F    20120130         East     West Bengal
9984     85012902      M    20120201         West         Gujarat
9985     14762484      M    20120131        North  Madhya Pradesh
9986     69453769      M    20120201        South      Tamil Nadu
9987      7060195      M    20120202         West         Gujarat
9988     91095093      M    20120201        South       Telangana
9989     91098168      M    20120201        South      Tamil Nadu
9990     91227615      M    20120203         West         Gujarat
9991     91136028      M    20120203         West     Maharashtra
9992       794622      F    20120203         West         Gujarat
9993     91289992      M    20120205         West     Maharashtra
9994     73876936      M    20120205         West         Gujarat
9995     50093138      M    20120208        North   Uttar Pradesh
9996     92763145      M    20120209        South       Telangana
9997     73839417      M    20120210        South       Karnataka
9998     69606859      M    20120215        North   Uttar Pradesh
9999    113292109      M    20120217         West     Maharashtra

            First_city  Recent_Date Last_region      Last_state  \
0                Surat     20130216        West         Gujarat
1                Delhi     20130129       North           Delhi
2                Surat     20130221        West         Gujarat
3     Pimpri-Chinchwad     20130222        West     Maharashtra
4                Delhi     20130301       North           Delhi
5                Surat     20130314        West         Gujarat
6        Visakhapatnam     20130318       South  Andhra Pradesh
7               Kanpur     20130321       North   Uttar Pradesh
8              Kolkata     20130331        East     West Bengal
9            Bangalore     20130325        West     Maharashtra
10              Nagpur     20120101        West     Maharashtra
11              Mumbai     20121111        East     West Bengal
12               Surat     20130314        West         Gujarat
13              Jaipur     20121126       North       Rajasthan
14               Delhi     20121013       North           Delhi
15              Kanpur     20130123       North   Uttar Pradesh
16           Ahmedabad     20120103        West         Gujarat
17           Ahmedabad     20130212       South       Telangana
18    Pimpri-Chinchwad     20130222        West     Maharashtra
19              Nagpur     20130313        West     Maharashtra
20           Bangalore     20130307       South       Karnataka
21       Visakhapatnam     20121229       South  Andhra Pradesh
22            Vadodara     20120111        West         Gujarat
23               Thane     20121210        West     Maharashtra
24             Kolkata     20130302        East     West Bengal
25              Bhopal     20120111       North  Madhya Pradesh
26               Surat     20120623        West         Gujarat
27              Indore     20130118       North  Madhya Pradesh
28             Kolkata     20130222       South       Karnataka
29               Delhi     20130108       North           Delhi
...                ...          ...         ...             ...
9970            Rajkot     20130330        West         Gujarat
9971             Delhi     20130222       North           Delhi
9972            Kanpur     20121014       North   Uttar Pradesh
9973             Surat     20130222        West         Gujarat
9974             Surat     20130319        West         Gujarat
9975             Thane     20120524        West         Gujarat
9976         Hyderabad     20130114       South       Telangana
9977             Surat     20120121        West         Gujarat
9978             Surat     20120127        West         Gujarat
9979           Kolkata     20121127       South       Telangana
9980             Surat     20130312        West         Gujarat
9981             Surat     20120131        West         Gujarat
9982           Chennai     20130313        West     Maharashtra
9983           Kolkata     20130310        East     West Bengal
9984             Surat     20130310        West         Gujarat
9985            Indore     20121211       North  Madhya Pradesh
9986           Chennai     20120201       South      Tamil Nadu
9987         Ahmedabad     20130328        West         Gujarat
9988         Hyderabad     20120201       South       Telangana
9989           Chennai     20120201       South      Tamil Nadu
9990             Surat     20120203        West         Gujarat
9991            Mumbai     20120523       South       Karnataka
9992             Surat     20120508        West         Gujarat
9993  Pimpri-Chinchwad     20120205        West     Maharashtra
9994             Surat     20130218        West         Gujarat
9995              Agra     20121114       North   Uttar Pradesh
9996         Hyderabad     20130319       South       Telangana
9997         Bangalore     20130216       South       Karnataka
9998           Lucknow     20120215       North   Uttar Pradesh
9999            Mumbai     20120217        West     Maharashtra

             Last_city  Customer_Value  Buy_Times  Points_Earned  \
0                Surat      2032.00000          2          200.0
1                Delhi      1709.00000          1          100.0
2                Surat       523.00000          1           10.0
3     Pimpri-Chinchwad      5132.00000          1          170.0
4                Delhi      1008.00000          1           60.0
5                Surat      2606.90000          1         1140.0
6        Visakhapatnam      1369.00000          1           79.0
7               Kanpur      5690.00000          1          360.0
8              Kolkata      2555.00000          2          190.0
9                Thane      2677.80000          3          145.0
10              Nagpur       855.00000          1           35.0
11            Bhatpara      5969.00000          5          294.0
12               Surat      9142.49700         10          639.0
13              Jaipur      8019.60000          5          609.0
14               Delhi     10380.19900          6         1189.0
15              Kanpur     14587.00000          6          865.0
16           Ahmedabad      1011.00000          1          115.0
17           Hyderabad      6065.30000          5          485.0
18    Pimpri-Chinchwad    145472.70200         36          680.0
19              Nagpur     19640.70000         12          268.0
20           Bangalore     32377.60200         22         1029.0
21       Visakhapatnam     17202.40000         13          449.0
22            Vadodara       900.50000          1          100.0
23    Pimpri-Chinchwad      4588.99900          4          190.0
24             Kolkata     33047.00400         31          141.0
25              Bhopal       878.00000          1           80.0
26           Ahmedabad     18358.00000          6          874.0
27              Indore     15426.39800         13         1672.0
28           Bangalore      5415.00100          6          736.0
29               Delhi     51692.99900         29         4275.0
...                ...             ...        ...            ...
9970            Rajkot     74662.77636         36           22.0
9971             Delhi     66082.19900         37         2385.0
9972            Kanpur      2031.00100          2          215.0
9973             Surat     14786.60000         12          337.0
9974             Surat     20696.90000         11         1935.0
9975             Surat     16858.09900         11          915.0
9976         Hyderabad     12863.00000          4         1030.0
9977             Surat       198.00000          1            0.0
9978             Surat       929.99900          1           50.0
9979         Hyderabad     12246.80000          6          600.0
9980             Surat     11723.00000         10          475.0
9981             Surat      1080.00000          1            0.0
9982            Mumbai     42195.09900         23         4441.0
9983           Kolkata     34492.90100         14         1591.0
9984             Surat     30123.30000          9         1555.0
9985            Bhopal     88407.50000         23         4317.0
9986           Chennai       480.00000          1           10.0
9987         Ahmedabad      6693.20000          3          645.0
9988         Hyderabad       825.99700          1           55.0
9989           Chennai       408.00000          1            0.0
9990             Surat       617.00000          1           35.0
9991         Bangalore      4383.80100          5           10.0
9992             Surat      8081.00000          4          594.0
9993  Pimpri-Chinchwad      1069.00000          1           81.0
9994             Surat      8059.59900          5          647.0
9995              Agra     13818.60000          7         1195.0
9996         Hyderabad     13016.50000          7          870.0
9997         Bangalore     44057.90000         11         2242.0
9998           Lucknow      1116.00000          1            0.0
9999            Mumbai      1222.00000          1           60.0

      Points_Redeemed
0                 0.0
1                 0.0
2                 0.0
3                 0.0
4                 0.0
5                 0.0
6                 0.0
7                 0.0
8                 0.0
9                 0.0
10                0.0
11                0.0
12                2.0
13                0.0
14                0.0
15                0.0
16                0.0
17                0.0
18            16635.0
19             2549.0
20             1771.0
21                0.0
22                0.0
23                0.0
24             2214.0
25                0.0
26                0.0
27                0.0
28                0.0
29               12.0
...               ...
9970          10472.0
9971          13520.0
9972              0.0
9973            300.0
9974              0.0
9975              0.0
9976              0.0
9977              0.0
9978              0.0
9979              0.0
9980              0.0
9981              0.0
9982              0.0
9983              0.0
9984              0.0
9985              0.0
9986            580.0
9987              0.0
9988              0.0
9989              0.0
9990              0.0
9991            370.0
9992              0.0
9993              0.0
9994              0.0
9995           1800.0
9996              0.0
9997            585.0
9998            310.0
9999              0.0

[10000 rows x 14 columns]>

In [13]:
cus_data.index

RangeIndex(start=0, stop=10000, step=1)

In [14]:
cus_data.dtypes.ndim

1

#Percentage Of Missing Values For Customer_Value variable

In [15]:
misi = cus_data.isnull().sum()
tval = len(cus_data)

In [16]:
per_mis = (misi/tval)*100
print  per_mis.Customer_Value

0.36

#Create Two Subsets With Unique and Duplicated Values

In [17]:
cus_data.duplicated().head(2)

0    False
1    False
dtype: bool

In [18]:
dups = cus_data[cus_data.duplicated() == True]
unique = cus_data[cus_data.duplicated() == False]

In [19]:
print "Duplicated Set"
print dups.head(2)
print " Unique Set"
print unique.head(2)

Duplicated Set
      Customer_ID Gender  First_Date First_region First_state First_city  \
9973     88092811      M    20120116         West     Gujarat      Surat
9974     84750517      F    20120119         West     Gujarat      Surat

      Recent_Date Last_region Last_state Last_city  Customer_Value  Buy_Times  \
9973     20130222        West    Gujarat     Surat         14786.6         12
9974     20130319        West    Gujarat     Surat         20696.9         11

      Points_Earned  Points_Redeemed
9973          337.0            300.0
9974         1935.0              0.0
 Unique Set
   Customer_ID Gender  First_Date First_region First_state First_city  \
0    129609144      M    20130130         West     Gujarat      Surat
1    129627580      M    20130129        North       Delhi      Delhi

   Recent_Date Last_region Last_state Last_city  Customer_Value  Buy_Times  \
0     20130216        West    Gujarat     Surat          2032.0          2
1     20130129       North      Delhi     Delhi          1709.0          1

   Points_Earned  Points_Redeemed
0          200.0              0.0
1          100.0              0.0

#Create Dataset with Customer_Value>10000

In [20]:
high_val = cus_data[cus_data.Customer_Value > 10000]
print high_val.head(2)

    Customer_ID Gender  First_Date First_region    First_state First_city  \
14      1610085      F    20120103        North          Delhi      Delhi
15      7518872      M    20120104        North  Uttar Pradesh     Kanpur

    Recent_Date Last_region     Last_state Last_city  Customer_Value  \
14     20121013       North          Delhi     Delhi       10380.199
15     20130123       North  Uttar Pradesh    Kanpur       14587.000

    Buy_Times  Points_Earned  Points_Redeemed
14          6         1189.0              0.0
15          6          865.0              0.0

#Create a new variable called Customer Value Segment
##-> High Value Segment (Customer_Value>25000)
###-> Medium Value Segment (10000<Customer_Value<25000)
####->Low Value Segment (Vustomer_Value<10000)

In [21]:
print cus_data.Customer_Value.max()

5098714.699

In [22]:
list = ['Low Value Segment','Medium Value Segment','High Value Segment']

In [23]:
cus_data['Customer Value Segment'] = pd.cut(cus_data.Customer_Value, bins = [0,10000,25000,6000000],right = True,labels=list)

In [24]:
cus_data.head(2)

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer Value Segment
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Value Segment
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Value Segment

#Create Variables Average_Revenue_Per_Trip and Balance_Points in customer data set

In [25]:
cus_data['Average Revenue Per Trip'] = (cus_data.Customer_Value / cus_data.Buy_Times)

In [26]:
cus_data['Balance Points'] = cus_data.Points_Earned - cus_data.Points_Redeemed

In [27]:
cus_data.head(2)

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer Value Segment,Average Revenue Per Trip,Balance Points
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Value Segment,1016.0,200.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Value Segment,1709.0,100.0

#How many days bw Recent_Date and First_Date

In [28]:
cus_data.First_Date.dtype

dtype('int64')

In [29]:
from datetime import datetime,timedelta,date

In [30]:
def conv(x):
    return pd.Period(year = x // 10000, month = x//100 % 100, day = x%100, freq='D')
cus_data['First_Date'].apply(conv)
cus_data['Recent_Date'].apply(conv)

0      2013-02-16
1      2013-01-29
2      2013-02-21
3      2013-02-22
4      2013-03-01
5      2013-03-14
6      2013-03-18
7      2013-03-21
8      2013-03-31
9      2013-03-25
10     2012-01-01
11     2012-11-11
12     2013-03-14
13     2012-11-26
14     2012-10-13
15     2013-01-23
16     2012-01-03
17     2013-02-12
18     2013-02-22
19     2013-03-13
20     2013-03-07
21     2012-12-29
22     2012-01-11
23     2012-12-10
24     2013-03-02
25     2012-01-11
26     2012-06-23
27     2013-01-18
28     2013-02-22
29     2013-01-08
          ...
9970   2013-03-30
9971   2013-02-22
9972   2012-10-14
9973   2013-02-22
9974   2013-03-19
9975   2012-05-24
9976   2013-01-14
9977   2012-01-21
9978   2012-01-27
9979   2012-11-27
9980   2013-03-12
9981   2012-01-31
9982   2013-03-13
9983   2013-03-10
9984   2013-03-10
9985   2012-12-11
9986   2012-02-01
9987   2013-03-28
9988   2012-02-01
9989   2012-02-01
9990   2012-02-03
9991   2012-05-23
9992   2012-05-08
9993   2012-02-05
9994   2013-02-18
9995   2012-11-14
9996   2013-03-19
9997   2013-02-16
9998   2012-02-15
9999   2012-02-17
Name: Recent_Date, Length: 10000, dtype: object

In [31]:
f_d = pd.to_datetime(cus_data['First_Date'],format = '%Y%m%d')

In [32]:
r_d = pd.to_datetime(cus_data['Recent_Date'],format = '%Y%m%d')

In [33]:
f_d.head(2)

0   2013-01-30
1   2013-01-29
Name: First_Date, dtype: datetime64[ns]

In [34]:
diff = r_d - f_d

In [35]:
diff.head(4)

0   17 days
1    0 days
2    0 days
3    0 days
dtype: timedelta64[ns]

In [36]:
cus_data['No Of Days '] = diff

In [37]:
cus_data.head(4)

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer Value Segment,Average Revenue Per Trip,Balance Points,No Of Days
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Value Segment,1016.0,200.0,17 days
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Value Segment,1709.0,100.0,0 days
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0,Low Value Segment,523.0,10.0,0 days
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0,Low Value Segment,5132.0,170.0,0 days

#Percentage_Of_Sales by each Last_city, Last_state, Last_region

In [38]:
sum_ls = cus_data.groupby('Last_state')['Customer_Value'].sum()

In [39]:
per_ls = (sum_ls / cus_data['Customer_Value'].sum())*100

In [40]:
per_ls.head(4)

Last_state
Andhra Pradesh    1.472727
Assam             1.557344
Bihar             0.260640
Chandigarh        0.032769
Name: Customer_Value, dtype: float64

In [41]:
sum_lr = cus_data.groupby('Last_region')['Customer_Value'].sum()

In [42]:
per_lr = (sum_lr / cus_data['Customer_Value'].sum())*100

In [43]:
per_lr

Last_region
East      7.798658
North    27.741557
South    15.403798
West     49.055986
Name: Customer_Value, dtype: float64

In [44]:
sum_lc = cus_data.groupby('Last_city')['Customer_Value'].sum()

In [45]:
per_lc = (sum_lc / cus_data['Customer_Value'].sum())*100

In [46]:
per_lc.head(4)

Last_city
Agartala     0.018824
Agra         0.268937
Ahmedabad    6.063446
Aligarh      0.025499
Name: Customer_Value, dtype: float64

#What is 
##-> Count Of Customers by Last_state and Last_city
###-> Average No Of Purchases by Last_state and Last_city
####->Average Purchase Transaction Value by Last_state and Last_city

In [47]:
cou_cus = pd.pivot_table(cus_data,index=['Last_state','Last_city'],values=['Customer_ID'],aggfunc=len)
cou_cus.head(4)

                           Customer_ID
Last_state     Last_city
Andhra Pradesh Guntur                1
               Kurnool               1
               Tirupati              2
               Vijayawada           20

In [48]:
avg_buy = pd.pivot_table(cus_data,index=['Last_state','Last_city'],values=['Buy_Times'])
avg_buy.head(4)

                           Buy_Times
Last_state     Last_city
Andhra Pradesh Guntur            3.0
               Kurnool           4.0
               Tirupati          6.0
               Vijayawada       10.1

In [49]:
avg_purc = pd.pivot_table(cus_data,index=['Last_state','Last_city'],values=['Customer_Value','Buy_Times'],aggfunc=np.sum)

In [50]:
avg_purc['Average Transaction Value'] = avg_purc.Customer_Value / avg_purc.Buy_Times

In [51]:
avg_purc.head(4)

                           Buy_Times  Customer_Value  \
Last_state     Last_city
Andhra Pradesh Guntur              3           0.000
               Kurnool             4        3113.499
               Tirupati           12       18500.000
               Vijayawada        202      493402.002

                           Average Transaction Value
Last_state     Last_city
Andhra Pradesh Guntur                       0.000000
               Kurnool                    778.374750
               Tirupati                  1541.666667
               Vijayawada                2442.584168